tests/performance.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "testuser"
            password: "test123"
      - get:
          url: "/api/transactions"
          headers:
            Authorization: "Bearer {{ token }}"